of60/tutorials/rheoFoam/fluidDamper/CarreauYasuda/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters .001;

vertices
(   
    (-55 5 -0.2183047145)
    (-10 5 -0.2183047145)
    (-9.7803300859	21.7803300859	-0.9509497484)
    (9.7803300859	21.7803300859	-0.9509497484)
    (10 5 -0.2183047145)
    (55 5 -0.2183047145)
    (55 21.7803300859	-0.9509497484)
    (55 25 -1.0915235727)
    (9.7803300859 25 -1.0915235727)
    (-9.7803300859 25 -1.0915235727)
    (-55 25 -1.0915235727)
    (-55 21.7803300859	-0.9509497484)
    
    (-55 5 0.2183047145)
    (-10 5 0.2183047145)
    (-9.7803300859	21.7803300859	0.9509497484)
    (9.7803300859	21.7803300859	0.9509497484)
    (10 5 0.2183047145)
    (55 5 0.2183047145)
    (55 21.7803300859	0.9509497484)
    (55 25 1.0915235727)
    (9.7803300859 25 1.0915235727)
    (-9.7803300859 25 1.0915235727)
    (-55 25 1.0915235727)
    (-55 21.7803300859	0.9509497484)
    
    (-55 13.5 -0.5894227293)
    (-10 13.5 -0.5894227293)
    (10 13.5  -0.5894227293)
    (55 13.5  -0.5894227293)
    
    (-55 13.5 0.5894227293)
    (-10 13.5 0.5894227293)
    (10 13.5  0.5894227293)
    (55 13.5  0.5894227293)
);

blocks
(
    hex (0 1 25 24 12 13 29 28) (40 15 1) simpleGrading (.08 4 1) //5
    hex (24 25 2 11 28 29 14 23) (40 15 1) simpleGrading (.08 .25 1) //0
    hex (11 2 9 10 23 14 21 22) (40 13 1) simpleGrading (.08 1 1) //1
    
    hex (2 3 8 9 14 15 20 21) (83 13 1) simpleGrading (1 1 1) //2
    
    hex (3 6 7 8 15 18 19 20) (40 13 1) simpleGrading (12.5 1 1) //3
    hex (26 27 6 3 30 31 18 15) (40 15 1) simpleGrading (12.5 .25 1) //4
    hex (4 5 27 26 16 17 31 30) (40 15 1) simpleGrading (12.5 4 1) //6
    
);

edges
(

polyLine 25 2
( 
(	-10	21.25	-0.9277950368	)
(	-9.9994217772	21.2794448618	-0.9290806272	)
(	-9.9976880003	21.3088443218	-0.9303642354	)
(	-9.9948013427	21.3381530481	-0.931643882	)
(	-9.9907662554	21.3673258488	-0.932917594	)
(	-9.9855889603	21.3963177415	-0.9341834074	)
(	-9.9792774403	21.4250840229	-0.9354393703	)
(	-9.9718414273	21.4535803374	-0.9366835463	)
(	-9.9632923872	21.4817627458	-0.9379140168	)
(	-9.9536435019	21.5095877928	-0.9391288846	)
(	-9.9429096494	21.5370125743	-0.9403262764	)
(	-9.9311073804	21.5639948032	-0.941504346	)
(	-9.9182548931	21.5904928748	-0.9426612768	)
(	-9.9043720053	21.6164659311	-0.9437952849	)
(	-9.8894801233	21.6418739235	-0.9449046218	)
(	-9.8736022092	21.6666776748	-0.945987577	)
(	-9.8567627458	21.6908389392	-0.9470424806	)
(	-9.8389876982	21.714320462	-0.948067706	)
(	-9.8203044742	21.7370860362	-0.9490616724	)
(	-9.8007418821	21.7591005591	-0.9500228473	)
)

polyLine 29 14
( 
(	-10	21.25	0.9277950368	)
(	-9.9994217772	21.2794448618	0.9290806272	)
(	-9.9976880003	21.3088443218	0.9303642354	)
(	-9.9948013427	21.3381530481	0.931643882	)
(	-9.9907662554	21.3673258488	0.932917594	)
(	-9.9855889603	21.3963177415	0.9341834074	)
(	-9.9792774403	21.4250840229	0.9354393703	)
(	-9.9718414273	21.4535803374	0.9366835463	)
(	-9.9632923872	21.4817627458	0.9379140168	)
(	-9.9536435019	21.5095877928	0.9391288846	)
(	-9.9429096494	21.5370125743	0.9403262764	)
(	-9.9311073804	21.5639948032	0.941504346	)
(	-9.9182548931	21.5904928748	0.9426612768	)
(	-9.9043720053	21.6164659311	0.9437952849	)
(	-9.8894801233	21.6418739235	0.9449046218	)
(	-9.8736022092	21.6666776748	0.945987577	)
(	-9.8567627458	21.6908389392	0.9470424806	)
(	-9.8389876982	21.714320462	0.948067706	)
(	-9.8203044742	21.7370860362	0.9490616724	)
(	-9.8007418821	21.7591005591	0.9500228473	)
)

//----
polyLine 26 3
( 
(	10	21.25	-0.9277950368	)
(	9.9994217772	21.2794448618	-0.9290806272	)
(	9.9976880003	21.3088443218	-0.9303642354	)
(	9.9948013427	21.3381530481	-0.931643882	)
(	9.9907662554	21.3673258488	-0.932917594	)
(	9.9855889603	21.3963177415	-0.9341834074	)
(	9.9792774403	21.4250840229	-0.9354393703	)
(	9.9718414273	21.4535803374	-0.9366835463	)
(	9.9632923872	21.4817627458	-0.9379140168	)
(	9.9536435019	21.5095877928	-0.9391288846	)
(	9.9429096494	21.5370125743	-0.9403262764	)
(	9.9311073804	21.5639948032	-0.941504346	)
(	9.9182548931	21.5904928748	-0.9426612768	)
(	9.9043720053	21.6164659311	-0.9437952849	)
(	9.8894801233	21.6418739235	-0.9449046218	)
(	9.8736022092	21.6666776748	-0.945987577	)
(	9.8567627458	21.6908389392	-0.9470424806	)
(	9.8389876982	21.714320462	-0.948067706	)
(	9.8203044742	21.7370860362	-0.9490616724	)
(	9.8007418821	21.7591005591	-0.9500228473	)
)

polyLine 30 15
( 
(	10	21.25	0.9277950368	)
(	9.9994217772	21.2794448618	0.9290806272	)
(	9.9976880003	21.3088443218	0.9303642354	)
(	9.9948013427	21.3381530481	0.931643882	)
(	9.9907662554	21.3673258488	0.932917594	)
(	9.9855889603	21.3963177415	0.9341834074	)
(	9.9792774403	21.4250840229	0.9354393703	)
(	9.9718414273	21.4535803374	0.9366835463	)
(	9.9632923872	21.4817627458	0.9379140168	)
(	9.9536435019	21.5095877928	0.9391288846	)
(	9.9429096494	21.5370125743	0.9403262764	)
(	9.9311073804	21.5639948032	0.941504346	)
(	9.9182548931	21.5904928748	0.9426612768	)
(	9.9043720053	21.6164659311	0.9437952849	)
(	9.8894801233	21.6418739235	0.9449046218	)
(	9.8736022092	21.6666776748	0.945987577	)
(	9.8567627458	21.6908389392	0.9470424806	)
(	9.8389876982	21.714320462	0.948067706	)
(	9.8203044742	21.7370860362	0.9490616724	)
(	9.8007418821	21.7591005591	0.9500228473	)
)

//-----

polyLine 2 3
( 
(	-9.7591005591	21.8007418821	-0.9518409467	)
(	-9.7370860362	21.8203044742	-0.9526950679	)
(	-9.714320462	21.8389876982	-0.9535107951	)
(	-9.6908389392	21.8567627458	-0.9542868704	)
(	-9.6666776748	21.8736022092	-0.9550220973	)
(	-9.6418739235	21.8894801233	-0.955715342	)
(	-9.6164659311	21.9043720053	-0.9563655356	)
(	-9.5904928748	21.9182548931	-0.9569716755	)
(	-9.5639948032	21.9311073804	-0.9575328273	)
(	-9.5370125743	21.9429096494	-0.9580481254	)
(	-9.5095877928	21.9536435019	-0.9585167756	)
(	-9.4817627458	21.9632923872	-0.958938055	)
(	-9.4535803374	21.9718414273	-0.9593113142	)
(	-9.4250840229	21.9792774403	-0.9596359775	)
(	-9.3963177415	21.9855889603	-0.9599115444	)
(	-9.3673258488	21.9907662554	-0.96013759	)
(	-9.3381530481	21.9948013427	-0.9603137657	)
(	-9.3088443218	21.9976880003	-0.9604397999	)
(	-9.2794448618	21.9994217772	-0.9605154982	)
(	-9.25	22	-0.960540744	)
(	0	22	-0.960540744	)
(	9.25	22	-0.960540744	)
(	9.279444862	21.99942178	-0.960515498	)
(	9.308844322	21.997688	-0.9604398	)
(	9.338153048	21.99480134	-0.960313766	)
(	9.367325849	21.99076626	-0.96013759	)
(	9.396317742	21.98558896	-0.959911544	)
(	9.425084023	21.97927744	-0.959635978	)
(	9.453580337	21.97184143	-0.959311314	)
(	9.481762746	21.96329239	-0.958938055	)
(	9.509587793	21.9536435	-0.958516776	)
(	9.537012574	21.94290965	-0.958048125	)
(	9.563994803	21.93110738	-0.957532827	)
(	9.590492875	21.91825489	-0.956971676	)
(	9.616465931	21.90437201	-0.956365536	)
(	9.641873924	21.88948012	-0.955715342	)
(	9.666677675	21.87360221	-0.955022097	)
(	9.690838939	21.85676275	-0.95428687	)
(	9.714320462	21.8389877	-0.953510795	)
(	9.737086036	21.82030447	-0.952695068	)
(	9.759100559	21.80074188	-0.951840947	)

)

polyLine 14 15
( 
(	-9.7591005591	21.8007418821	0.9518409467	)
(	-9.7370860362	21.8203044742	0.9526950679	)
(	-9.714320462	21.8389876982	0.9535107951	)
(	-9.6908389392	21.8567627458	0.9542868704	)
(	-9.6666776748	21.8736022092	0.9550220973	)
(	-9.6418739235	21.8894801233	0.955715342	)
(	-9.6164659311	21.9043720053	0.9563655356	)
(	-9.5904928748	21.9182548931	0.9569716755	)
(	-9.5639948032	21.9311073804	0.9575328273	)
(	-9.5370125743	21.9429096494	0.9580481254	)
(	-9.5095877928	21.9536435019	0.9585167756	)
(	-9.4817627458	21.9632923872	0.958938055	)
(	-9.4535803374	21.9718414273	0.9593113142	)
(	-9.4250840229	21.9792774403	0.9596359775	)
(	-9.3963177415	21.9855889603	0.9599115444	)
(	-9.3673258488	21.9907662554	0.96013759	)
(	-9.3381530481	21.9948013427	0.9603137657	)
(	-9.3088443218	21.9976880003	0.9604397999	)
(	-9.2794448618	21.9994217772	0.9605154982	)
(	-9.25	22	0.960540744	)
(	0	22	0.960540744	)
(	9.25	22	0.960540744	)
(	9.279444862	21.99942178	0.960515498	)
(	9.308844322	21.997688	0.9604398	)
(	9.338153048	21.99480134	0.960313766	)
(	9.367325849	21.99076626	0.96013759	)
(	9.396317742	21.98558896	0.959911544	)
(	9.425084023	21.97927744	0.959635978	)
(	9.453580337	21.97184143	0.959311314	)
(	9.481762746	21.96329239	0.958938055	)
(	9.509587793	21.9536435	0.958516776	)
(	9.537012574	21.94290965	0.958048125	)
(	9.563994803	21.93110738	0.957532827	)
(	9.590492875	21.91825489	0.956971676	)
(	9.616465931	21.90437201	0.956365536	)
(	9.641873924	21.88948012	0.955715342	)
(	9.666677675	21.87360221	0.955022097	)
(	9.690838939	21.85676275	0.95428687	)
(	9.714320462	21.8389877	0.953510795	)
(	9.737086036	21.82030447	0.952695068	)
(	9.759100559	21.80074188	0.951840947	)
)
);

boundary
(
    left
    {
        type wall;
        faces
        (
            (0 24 28 12)
            (24 11 23 28)
            (11 10 22 23)
        );
    }
    right
    {
        type wall;
        faces
        (
            (5 27 31 17)
            (27 6 18 31)
            (6 7 19 18)
        );
    }
    top
    {
        type wall;
        faces
        (
            (10 9 21 22)
            (9 8 20 21)
            (8 7 19 20)
        );
    }
    piston
    {
        type wall;
        faces
        (
            (1 25 29 13)
            (25 2 14 29)
            (2 3 15 14)
            (26 3 15 30)
            (4 26 30 16)
        );
    }  
    shaft
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (4 5 17 16)
        );
    }
    wedge0
    {
        type wedge;
        faces
        (
            (0 1 25 24)
            (11 2 9 10)
            (24 25 2 11)
            (2 3 8 9)
            (3 6 7 8)
            (26 27 6 3)
            (4 5 27 26)
        );
    }
    wedge1
    {
        type wedge;
        faces
        (
            (12 13 29 28)
            (28 29 14 23)
            (23 14 21 22)
            (14 15 20 21)
            (15 18 19 20)
            (30 31 18 15)
            (16 17 31 30)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
